MaciekMr/STM32_desk_lift/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define DRV_CS_Pin GPIO_PIN_0
#define DRV_CS_GPIO_Port GPIOB
#define LCD_CS_Pin GPIO_PIN_1
#define LCD_CS_GPIO_Port GPIOB
#define LCD_RST_Pin GPIO_PIN_2
#define LCD_RST_GPIO_Port GPIOB
#define LEVEL_2_Pin GPIO_PIN_12
#define LEVEL_2_GPIO_Port GPIOB
#define LEVEL_1_Pin GPIO_PIN_13
#define LEVEL_1_GPIO_Port GPIOB
#define DOWN_Pin GPIO_PIN_14
#define DOWN_GPIO_Port GPIOB
#define UP_Pin GPIO_PIN_15
#define UP_GPIO_Port GPIOB
#define MOTOR_SLEEP_Pin GPIO_PIN_8
#define MOTOR_SLEEP_GPIO_Port GPIOA
#define MOTOR_DISABLE_Pin GPIO_PIN_9
#define MOTOR_DISABLE_GPIO_Port GPIOA
#define MOTOR_IN2_Pin GPIO_PIN_10
#define MOTOR_IN2_GPIO_Port GPIOA
#define MOTOR_IN1_Pin GPIO_PIN_11
#define MOTOR_IN1_GPIO_Port GPIOA
#define LED_OUT_Pin GPIO_PIN_3
#define LED_OUT_GPIO_Port GPIOB
#define FREQ_MEAS_Pin GPIO_PIN_4
#define FREQ_MEAS_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
